subscribe = اشترك
back = العودة
next = التالي
language = اللغة
get_bitcoin = احصل على BTC
my_wallets = محفظتي
withdraw = سحب
tasks = المهام
invite_friends = دعوة الأصدقاء
change = تغيير
main_menu = القائمة الرئيسية
withdrawal = السحب إلى
mining = التعدين
darts = رمي السهام
basketball = كرة السلة
search_for_block = ابدأ البحث عن كتلة
throw_dart = ارمي السهم
language_changed = تم تغيير اللغة بنجاح!
enter_new_wallet = أدخل رقم محفظتك الجديد
wallet_changed = تم تغيير المحفظة بنجاح!
game_cooldown = لقد لعبت هذا اللعبة اليوم بالفعل. جرب مرة أخرى غدًا!
darts_win = 🎉 مبروك! أصبت الهدف وربحت 0.0001 BTC! عمل رائع!
darts_lose = 😕 للأسف، لقد أخطأت اليوم. لا تستسلم، جرب مرة أخرى غدًا!
start_mining = تم بدء عملية التعدين
mining_success_end = 🎉 تم العثور على الكتلة! لقد ربحت 0.0001 BTC.
insufficient_funds = 🔴 ليس لديك أموال كافية في الحساب.
main_menu_caption = <b>CRYPTO APATE BOT -> القائمة الرئيسية</b>

    أنت: <b>#SWK58XOH</b>
    الرصيد: <b>{$balance}BTC</b>
    السحوبات: <b>0BTC</b>
    الترتيب في القمة: <b>لا يوجد</b>

    <a href="https://t.me/+h9EN6YjY--05YjEy">💬 <b>الدردشة</b></a>
mining_game_caption = <b>CRYPTO APATE BOT -> احصل على BTC</b>

    <b>وصف موجز لعملية التعدين:</b>
    <code>إنها عملية حل مشاكل رياضية معقدة باستخدام خوارزمية التشفير SHA-256. يقوم المعدنون بالتحقق من المعاملات وإنشاء كتل جديدة للبلوكشين عن طريق إيجاد تجزئة فريدة.</code>

    <b>لماذا يمكنك الحصول على بيتكوين مقابل هذا:</b>
    <code>يتم منح المعدنين بيتكوين لإضافة الكتل بنجاح إلى البلوكشين. هذا يحفز المشاركين في الشبكة للحفاظ على عملها وأمانها.</code>
darts_game_caption = <b>CRYPTO APATE BOT -> احصل على BTC</b>

    <b>🎯 مرحبًا بك في لعبة رمي السهام!</b>
    اختبر دقتك واربح <b>BTC!</b>
    أصب الهدف واحصل على <b>0.0001BTC</b> عن كل رمية ناجحة.

    <i>اللعبة متاحة مرة واحدة يوميًا، لذا ركز واحصل على جائزتك!</i>
    هل أنت مستعد لرمي السهم والفوز؟ جرب الآن!;

gamezone_caption = <b>CRYPTO APATE BOT -> احصل على BTC</b>

    <b>مرحبًا بك في منطقة الألعاب! 🎮</b>

    اختر واحدة من الألعاب المصغرة المثيرة واربح <b>BTC</b> الآن:
    ⛏️ <b>التعدين</b> – اذهب إلى المناجم الافتراضية واستخرج البيتكوين!
    🎯 <b>رمي السهام</b> – الدقة هي المفتاح! أصب الهدف واحصل على مكافأتك.
    🏀 <b>كرة السلة</b> – ارم الكرة في السلة واربح البيتكوين.

    <i>كل لعبة هي فرصة لزيادة رأسمالك الرقمي!</i>

    <b>يمكنك لعب كل لعبة مرة واحدة يوميًا!</b>

    اختر لعبتك المفضلة وابدأ في كسب <i><b>BTC</b></i> الآن!

user_wallets_caption = <b>CRYPTO APATE BOT -> المحافظ</b>

    أدخل رقم محفظتك لسحب الأموال. يرجى التحقق من صحة البيانات المدخلة لتجنب أي أخطاء في التحويل.

    <b>BITCOIN:</b> {$bitcoin_wallet}
    <b>TON:</b> {$ton_wallet}
    <b>TRC20:</b> {$trc20_wallet}

withdraw_caption = <b>CRYPTO APATE BOT -> السحب</b>

    <b>💼 سحب الأموال</b>

    هنا يمكنك سحب BTC الذي كسبته إلى المحفظة التي قمت بتحديدها. تأكد من أن رصيدك كافٍ للسحب، وتحقق من صحة البيانات المدخلة.

    الحد الأدنى للسحب: <b>0.000018BTC (50$)</b>.

    <i>قد يستغرق السحب بعض الوقت حسب حمل الشبكة.</i>

language_caption = <b>CRYPTO APATE BOT -> اختيار اللغة</b>

    اختر لغة لاستخدام الروبوت بسهولة.

    سيتم تطبيق اختيارك على جميع الأقسام والقوائم لتسهيل التفاعل مع الخدمة.

withdraw_request_created = 🟡 <b>تم إنشاء طلب السحب بنجاح!</b>

    الآن <b>حدد المبلغ</b> الذي تريد سحبه وسيتم استكمال طلبك. بعد ذلك سيتم إرسال BTC إلى المحفظة المحددة في أقرب وقت ممكن.

    رقم محفظتك:
    <code>{$wallet}</code>

withdraw_request_sent = تم إرسال طلب السحب بنجاح!
