back = رجوع
basketball = كرة السلة
basketball_game_caption = <b>CRYPTO QUEST -> الحصول على BTC</b>

    <b>🏀 مرحبًا بك في لعبة كرة السلة!</b>

    اختبر مهاراتك في التسديد واربح <b>BTC</b>!

    سجل النقاط واربح من <b>0.0000017BTC</b> إلى <b>0.000017</b> عن كل تسديدة ناجحة.

    <i>اللعبة متاحة مرة واحدة يوميًا، لذا صوب بدقة واحصل على مكافأتك!</i>

    مستعد لتسديد الكرة والفوز؟ جرب الآن!

cancel = إلغاء
change = تغيير
close = إغلاق
connect = توصيل
daily_reward = مكافأة يومية
daily_reward_caption = <b>CRYPTO QUEST -> مكافأة يومية</b>

    <b>احصل على ₿ يوميًا!</b>

    ادخل التطبيق يوميًا واحصل على مكافأة بعملة البيتكوين!

    كل يوم لديك فرصة للحصول على مكافأة من <b>0.0000017BTC ≈ 0.1$</b> إلى <b>0.000017BTC ≈ 1$</b> فقط لدخول التطبيق.

    لا تفوت يوما للاستفادة من مكافأة اليوم اليومية!

daily_reward_message = <b>🎉 مفاجأة اليوم! لقد حصلت على {$reward}BTC ≈ {$dollarReward}$! 💫</b>

    استمر في العودة يوميًا لمزيد من الجوائز ولتكن الحظوظ معك! 🍀

daily_reward_received = 🔴 أوه! يبدو أنك قد حصلت بالفعل على مكافأتك اليوم! عد غدًا لمفاجأة جديدة. حظا سعيدا! 🍀
darts = لعبة السهام
darts_game_caption = <b>CRYPTO QUEST -> الحصول على BTC</b>

    <b>🎯 مرحبًا بك في لعبة السهام!</b>

    اختبر دقتك واربح <b>BTC</b>!

    اصب الهدف واربح من <b>0.0000017BTC</b> إلى <b>0.000017BTC</b> عن كل تسديدة ناجحة.

    <i>اللعبة متاحة مرة واحدة يوميًا، لذا ركز واربح مكافأتك!</i>
    مستعد لرمي السهم والفوز؟ جرب الآن!

darts_lose = 😕 للأسف، لم تصب الهدف اليوم. لا تستسلم، جرب غدًا!
darts_win = 🎉 تهانينا! لقد أصبت الهدف وحصلت على {$reward} BTC! عمل رائع!
done = تم
football = كرة القدم
football_game_caption = <b>CRYPTO QUEST -> الحصول على BTC</b>

    <b>⚽ مرحبًا بك في لعبة كرة القدم!</b>

    أظهر مهاراتك واربح <b>BTC</b>!

    سجل الأهداف واربح من <b>0.0000017BTC</b> إلى <b>0.000017BTC</b> عن كل هدف ناجح.

    <i>اللعبة متاحة مرة واحدة يوميًا، لذا صوب بدقة واحصل على مكافأتك!</i>

    مستعد للعب والفوز؟ جرب الآن!
enter_new_wallet = أدخل رقم محفظتك الجديد
game_cooldown = لقد لعبت هذه اللعبة اليوم. جرب غدًا!
gamezone = منطقة الألعاب
gamezone_caption = <b>CRYPTO QUEST -> الحصول على BTC</b>

    <b>مرحبًا بك في منطقة الألعاب! 🎮</b>

    اختر واحدة من الألعاب المصغرة المثيرة واربح <b>BTC</b> الآن:

    ⛏️ <b>التعدين</b> – اذهب إلى المناجم الافتراضية واحصل على البيتكوين!
    🎯 <b>لعبة السهام</b> – الدقة هي المفتاح! اصب الهدف واربح المكافأة.
    🏀 <b>كرة السلة</b> – سجل النقاط واربح البيتكوين.

    <i>كل لعبة هي فرصة لزيادة رصيدك من العملات المشفرة!

    <b>يمكنك اللعب مرة واحدة يوميًا!</b>

    اختر لعبتك المفضلة وابدأ في كسب <b>BTC</b>!</i>

get_bitcoin = احصل على BTC
get_daily_reward = احصل على المكافأة
insufficient_funds = 🔴 ليس لديك رصيد كافٍ.
invite_friends = دعوة الأصدقاء
language = اللغة
language_caption = <b>CRYPTO QUEST -> اختيار اللغة</b>

    اختر اللغة لتسهيل استخدام البوت.

    سيتم تطبيق اختيارك على جميع الأقسام والقوائم لتسهيل تفاعلك مع الخدمة.

language_changed = تم تغيير اللغة بنجاح!
main_menu = القائمة الرئيسية
main_menu_caption = <b>CRYPTO QUEST -> القائمة الرئيسية</b>

    أنت: <b>{$username}</b>
    الرصيد: <b>{$balance}BTC ≈ {$dollarBalance}$</b>
    المسحوب: <b>{$withdrawn}BTC ≈ {$dollarWithdrawn}$</b>
    عدد الإحالات: <b>{$referrals}</b>
    مركزك في التصنيف: <b>لا يوجد</b>

    <a href="google.com">💬 <b>الدردشة</b></a>
mining = التعدين
mining_game_caption = <b>CRYPTO QUEST -> الحصول على BTC</b>

    <b>شرح موجز لعملية التعدين:</b>
    <code>إنها عملية حل مسائل رياضية معقدة باستخدام خوارزمية SHA-256. يقوم المعدنون بالتحقق من المعاملات وإنشاء كتل جديدة لسلسلة الكتل عبر إيجاد الهاش الفريد.</code>

    <b>لماذا يمكنك الحصول على البيتكوين لهذا:</b>
    <code>المعدنون يحصلون على البيتكوين مقابل إضافة كتلة جديدة إلى السلسلة. هذا يحفز المشاركين في الشبكة على الحفاظ على تشغيلها وأمانها.</code>

mining_success_end = 🎉 تم العثور على الكتلة! لقد ربحت {$reward} BTC.
my_wallets = محافظي
next = التالي
no_subscribe = 🔴 لم تكمل المهمة بعد. أكمل المهمة للحصول على مكافأتك!
operation1 = بدء عملية التعدين
operation10 = دمج الكتلة في السلسلة وتحديث البيانات على جميع العقد
operation2 = تشغيل خوارزمية SHA-256 للبحث عن الهاش المناسب
operation3 = إنشاء اتصال مع شبكة العقد الموزعة
operation4 = جمع بيانات المعاملات لتشكيل الكتلة الجديدة
operation5 = التحقق من سلامة البيانات والتحقق من المعاملات
operation6 = تحسين القدرة الحسابية لحل الكتلة
operation7 = البحث عن nonce الصحيح لتحقيق الهدف من قيمة الهاش
operation8 = بدء عملية التعدين
operation9 = تأكيد الحل ونشره في الشبكة
referral_message = 🚀 هل تريد تجربة شيء مذهل؟ لقد وجدت بوتًا يتيح لك ربح البيتكوين من خلال لعب الألعاب المصغرة! 🎮 🎯

    ارمي السهام، احفر للبيتكوين، أو سجل النقاط في السلة – وفي كل مرة تحصل على BTC حقيقي! 💸

referrals_caption = <b>CRYPTO QUEST -> الإحالات</b>

    <b>ادعُ أصدقاءك واحصل على مكافآت!</b> 👥

    انضم إلى برنامج الإحالة: عن كل مستخدم تدعوه، ستحصل على مكافأة. <b>({$reward}BTC ≈ {$dollarReward}$)</b>

    شارك رابط الإحالة الخاص بك وزد فرصك في الحصول على الجوائز.
    كلما زاد عدد الأصدقاء – زادت المكافآت!

search_for_block = ابدأ البحث عن كتلة
start_mining = عملية التعدين بدأت
subscribe = اشترك
subscribed = مشترك
task_completed = 🔴 لقد أكملت هذه المهمة بالفعل. شكرًا لمشاركتك!
task_message = <b>CRYPTO QUEST -> المهمة</b>

    {$taskDescription}

    <b>{$award}BTC ≈ {$dollarReward}$</b>

    🔗 <a href="">الرابط</a>
    {$link}

    في انتظار...

tasks = المهام
thanks_for_subscribe = <b>CRYPTO QUEST -> المهمة</b>

                       🟢 شكرًا لك على إكمال المهمة!

                       تم الحصول على <b>{$award}BTC ≈ {$dollarReward}$</b>

throw_ball = رمي الكرة
throw_dart = رمي السهم
user_wallets_caption = <b>CRYPTO QUEST -> المحافظ</b>

    أدخل رقم المحفظة لسحب الأموال. يرجى التحقق من صحة البيانات لتجنب الأخطاء أثناء التحويل.

    <b>البيتكوين:</b> {$bitcoin_wallet}
    <b>TON:</b> {$ton_wallet}
    <b>TRC20:</b> {$trc20_wallet}

wallet_changed = تم تغيير المحفظة بنجاح!
withdraw = سحب الأموال
withdraw_caption = <b>CRYPTO QUEST -> السحب</b>

    <b>💼 سحب الأموال</b>

    هنا يمكنك سحب BTC التي ربحتها إلى المحفظة التي قمت بإدخالها. تأكد من أن رصيدك كافٍ للسحب وت
