get_daily_reward = احصل على المكافأة
gamezone = منطقة الألعاب
daily_reward = المكافأة اليومية
connect = الاتصال
close = إغلاق
cancel = إلغاء
subscribe = الاشتراك
subscribed = تم الاشتراك
done = تم
back = العودة
next = التالي
language = اللغة
get_bitcoin = احصل على BTC
my_wallets = محفظتي
withdraw = سحب
tasks = المهام
invite_friends = دعوة الأصدقاء
change = تغيير
main_menu = القائمة الرئيسية
withdrawal = السحب إلى
mining = التعدين
darts = رمي السهام
basketball = كرة السلة
search_for_block = بدء البحث عن كتلة
throw_dart = رمي السهم
throw_ball = رمي الكرة
language_changed = تم تغيير اللغة بنجاح!
enter_new_wallet = أدخل رقم محفظتك الجديد
wallet_changed = تم تغيير المحفظة بنجاح!
game_cooldown = لقد لعبت هذه اللعبة اليوم بالفعل. حاول مرة أخرى غداً!
darts_win = 🎉 تهانينا! لقد أصبت الهدف وربحت {$reward} BTC! عمل رائع!
darts_lose = 😕 للأسف، أخطأت اليوم. لكن لا تستسلم، جرب مرة أخرى غداً!
start_mining = تم بدء عملية التعدين
mining_success_end = 🎉 تم العثور على الكتلة! لقد ربحت 0.000017 BTC.
insufficient_funds = 🔴 ليس لديك ما يكفي من الأموال في الحساب.
no_subscribe = 🔴 لم تكمل المهمة بعد. أكمل المهمة لتحصل على مكافأتك!
referral_message = 🚀 هل ترغب في تجربة شيء مذهل؟ وجدت روبوتاً يمكنك من خلاله ربح BTC فقط بلعب الألعاب الصغيرة! 🎮 🎯

    ارم السهام، أو قم بتعدين البيتكوين، أو احصل على سلة – وكل مرة تكسب فيها BTC حقيقي! 💸
task_message = <b>CRYPTO QUEST -> المهمة</b>

    {$taskDescription}

    <b>{$award}BTC</b>

    🔗 <a href="">رابط</a>
    {$link}

    انتظار...
thanks_for_subscribe = <b>CRYPTO QUEST -> المهمة</b>

                       🟢 شكراً لك على إكمال المهمة!

                       لقد حصلت على <b>{$award}BTC.</b>
main_menu_caption = <b>CRYPTO QUEST -> القائمة الرئيسية</b>

    أنت: <b>{$username}</b>
    الرصيد: <b>{$balance}BTC</b>
    تم السحب: <b>{$withdrawn}BTC</b>
    الإحالات: <b>{$referrals}</b>
    الترتيب في القمة: <b>لا يوجد</b>

    <a href="google.com">💬 <b>الدردشة</b></a>
mining_game_caption = <b>CRYPTO QUEST -> احصل على BTC</b>

    <b>وصف موجز لعملية التعدين:</b>
    <code>هذه عملية حل مسائل رياضية معقدة باستخدام خوارزمية SHA-256 التشفيرية. يقوم المعدنون بالتحقق من المعاملات وإنشاء كتل جديدة لسلسلة البلوكشين عن طريق إيجاد تجزئة فريدة.</code>

    <b>لماذا يمكنك الحصول على البيتكوين مقابل هذا:</b>
    <code>لإضافة كتلة بنجاح إلى سلسلة البلوكشين، يحصل المعدنون على بيتكوين. هذا يحفز المشاركين في الشبكة على دعم تشغيلها وأمنها.</code>
darts_game_caption = <b>CRYPTO QUEST -> احصل على BTC</b>

    <b>🎯 مرحباً بك في لعبة رمي السهام!</b>
    اختبر دقتك واربح <b>BTC!</b>
    اصب الهدف واربح من <b>0.0000017BTC</b> إلى <b>0.000017BTC</b> لكل رمية ناجحة.

    <i>اللعبة متاحة مرة واحدة في اليوم، لذا ركز واحصل على مكافأتك!</i>
    هل أنت جاهز لرمي السهم والفوز؟ جربها الآن!
gamezone_caption = <b>CRYPTO QUEST -> احصل على BTC</b>

    <b>مرحباً بك في منطقة الألعاب! 🎮</b>

    اختر واحدة من الألعاب الصغيرة الممتعة وابدأ في ربح <b>BTC</b> الآن:
    ⛏️ <b>التعدين</b> – انطلق إلى المناجم الافتراضية واستخرج البيتكوين!
    🎯 <b>رمي السهام</b> – الدقة تحدد النجاح! اصب الهدف واحصل على مكافأة.
    🏀 <b>كرة السلة</b> – ارمِ الكرة في السلة واربح البيتكوين.

    <i>كل لعبة فرصة لزيادة رأس مالك من العملات المشفرة!

    <b>يمكنك لعب كل لعبة مرة واحدة في اليوم!</b>

    اختر لعبتك المفضلة وابدأ في كسب</i><b> BTC</b>!
basketball_game_caption = <b>CRYPTO QUEST -> احصل على BTC</b>

    <b>🏀 مرحباً بك في لعبة كرة السلة!</b>

    اختبر مهاراتك في الرمي واربح <b>BTC</b>!
    احرز الكرات في السلة واربح من <b>0.0000017BTC</b> إلى <b>0.000017BTC</b> لكل رمية ناجحة.

    <i>اللعبة متاحة مرة واحدة في اليوم، لذا ركز جيداً واحصل على مكافأتك!</i>

    هل أنت جاهز للرمي والفوز؟ جرب الآن!
user_wallets_caption = <b>CRYPTO QUEST -> المحافظ</b>

    أدخل رقم محفظتك لسحب الأموال. من فضلك تأكد من صحة البيانات لتجنب الأخطاء أثناء التحويل.

    <b>BITCOIN:</b> {$bitcoin_wallet}
    <b>TON:</b> {$ton_wallet}
    <b>TRC20:</b> {$trc20_wallet}
withdraw_caption = <b>CRYPTO QUEST -> السحب</b>

    <b>💼 سحب الأموال</b>

    هنا يمكنك سحب BTC الذي كسبته إلى المحفظة التي حددتها. تأكد من أن رصيدك كافٍ للسحب وتحقق من صحة البيانات المدخلة.

    الحد الأدنى للسحب: <b>0.0086BTC (500$)</b>.

    <i>قد يستغرق السحب بعض الوقت حسب تحميل الشبكة.</i>
language_caption = <b>CRYPTO QUEST -> اختيار اللغة</b>

    اختر لغة لاستخدام مريح للروبوت.

    سيتم تطبيق اختيارك على جميع الأقسام والقوائم لتسهيل التفاعل مع الخدمة.
withdraw_request_created = 🟡 <b>تم إنشاء طلب السحب بنجاح!</b>

    الآن <b>أدخل المبلغ</b> الذي تريد سحبه وسيتم استكمال طلبك بالكامل. بعد ذلك، سيتم إرسال BTC إلى المحفظة التي حددتها في أقرب وقت.

    رقم محفظتك:
    <code>{$wallet}</code>
referrals_caption = <b>CRYPTO QUEST -> الإحالات</b>

    <b>ادعُ أصدقاءك واحصل على المكافآت!</b> 👥

    انضم إلى برنامج الإحالة الخاص بنا: ستحصل على مكافأة عن كل مستخدم تدعوه. <b>({$reward}BTC)</b>

    شارك رابط الإحالة الفريد الخاص بك وزد من فرصك في الفوز بالجوائز.
    كلما زاد عدد الأصدقاء، زادت المكافآت!
daily_reward_caption = <b>CRYPTO QUEST -> المكافأة اليومية</b>

    <b>احصل على ₿ يومياً!</b>

    قم بتسجيل الدخول إلى التطبيق يومياً واحصل على مكافأة البيتكوين!

    كل يوم لديك فرصة للحصول على مكافأة من <b>0.0000017BTC</b> إلى <b>0.000017BTC</b> فقط لدخولك إلى التطبيق.

    لا تفوت يوماً للاستفادة من المكافأة اليومية!
daily_reward_message = <b>🎉 مفاجأة اليوم! الحظ منحك {$reward}BTC اليوم! 💫</b>

    استمر في تسجيل الدخول يومياً للحصول على مكافآت جديدة وليكن الحظ دائماً معك! 🍀
daily_reward_received = 🔴 عذراً! يبدو أنك قد حصلت على مكافأتك اليومية بالفعل! عُد غداً للحصول على مفاجأة جديدة. حظاً سعيداً! 🍀
withdraw_request_sent = تم إرسال طلب السحب بنجاح!
operation1 = تهيئة عملية التعدين
operation2 = بدء خوارزمية التشفير SHA-256 للبحث عن التجزئة الصحيحة
operation3 = إنشاء اتصال مع شبكة العقد الموزعة
operation4 = جمع بيانات المعاملات لتشكيل كتلة جديدة
operation5 = التحقق من سلامة البيانات والتحقق من صحة المعاملات
operation6 = تحسين القدرات الحاسوبية لحل الكتلة
operation7 = البحث عن الرقم nonce الصحيح لتحقيق قيمة التجزئة المستهدفة
operation8 = تهيئة عملية التعدين
operation9 = تأكيد الحل الذي تم العثور عليه وبثه إلى الشبكة
operation10 = إضافة الكتلة إلى السلس
