subscribe = सदस्यता लें
back = वापस
next = आगे
language = भाषा
get_bitcoin = BTC प्राप्त करें
my_wallets = मेरे वॉलेट्स
withdraw = निकासी करें
tasks = कार्य
invite_friends = दोस्तों को आमंत्रित करें
change = बदलें
main_menu = मुख्य मेनू
withdrawal = निकासी में
mining = माइनिंग
darts = डार्ट्स
basketball = बास्केटबॉल
search_for_block = ब्लॉक की खोज शुरू करें
throw_dart = डार्ट फेंको
language_changed = भाषा सफलतापूर्वक बदल दी गई है!
enter_new_wallet = कृपया अपना नया वॉलेट नंबर दर्ज करें
wallet_changed = वॉलेट सफलतापूर्वक बदल दिया गया है!
game_cooldown = आपने आज पहले ही यह खेल खेल लिया है। कृपया कल फिर से प्रयास करें!
darts_win = 🎉 बधाई हो! आपने सही निशाना लगाया और 0.0001 BTC जीता! शानदार काम!
darts_lose = 😕 अफसोस की बात है, आज निशाना चूक गया। लेकिन हार मत मानो, कल फिर से प्रयास करें!
start_mining = माइनिंग प्रक्रिया शुरू हो गई है
mining_success_end = 🎉 ब्लॉक मिला! आपने 0.0001 BTC कमाए।
insufficient_funds = 🔴 आपके खाते में पर्याप्त धनराशि नहीं है।
main_menu_caption = <b>CRYPTO QUEST -> मुख्य मेनू</b>

    आप: <b>#SWK58XOH</b>
    शेष राशि: <b>{$balance}BTC</b>
    निकासी की गई: <b>0BTC</b>
    टॉप स्थान: <b>नहीं</b>

    <a href="https://t.me/+h9EN6YjY--05YjEy">💬 <b>चैट</b></a>
mining_game_caption = <b>CRYPTO QUEST -> BTC प्राप्त करें</b>

    <b>माइनिंग प्रक्रिया का संक्षिप्त विवरण:</b>
    <code>यह क्रिप्टोग्राफिक SHA-256 एल्गोरिथ्म का उपयोग करके जटिल गणितीय समस्याओं को हल करने की प्रक्रिया है। माइनर लेनदेन की पुष्टि करते हैं और ब्लॉकचेन के लिए नए ब्लॉक बनाते हैं, एक अद्वितीय हैश खोजते हैं।</code>

    <b>इससे बिटकॉइन कैसे मिलता है?</b>
    <code>ब्लॉकचेन में सफलतापूर्वक ब्लॉक जोड़ने के लिए माइनरों को बिटकॉइन मिलता है। यह नेटवर्क के संचालन और सुरक्षा को बनाए रखने के लिए भागीदारों को प्रेरित करता है।</code>
darts_game_caption = <b>CRYPTO QUEST -> BTC प्राप्त करें</b>

    <b>🎯 डार्ट्स में आपका स्वागत है!</b>
    अपनी सटीकता का परीक्षण करें और <b>BTC</b> अर्जित करें!
    निशाने पर लगाओ और हर सफल थ्रो पर <b>0.0001BTC</b> पाओ।

    <i>यह खेल दिन में एक बार उपलब्ध है, इसलिए ध्यान केंद्रित करें और अपना पुरस्कार प्राप्त करें!</i>
    क्या आप डार्ट फेंकने के लिए तैयार हैं और जीतने के लिए तैयार हैं? अभी प्रयास करें!;

gamezone_caption = <b>CRYPTO QUEST -> BTC प्राप्त करें</b>

    <b>खेल क्षेत्र में आपका स्वागत है! 🎮</b>

    रोमांचक मिनी-गेम्स में से एक चुनें और अभी <b>BTC</b> अर्जित करें:
    ⛏️ <b>माइनिंग</b> – वर्चुअल माइंस में जाएं और बिटकॉइन कमाएं!
    🎯 <b>डार्ट्स</b> – सटीकता मायने रखती है! निशाने पर लगाओ और पुरस्कार पाओ।
    🏀 <b>बास्केटबॉल</b> – बॉल को रिंग में डालो और बिटकॉइन जीतो।

    <i>हर खेल आपकी क्रिप्टो पूंजी को बढ़ाने का मौका है!</i>

    <b>हर खेल को दिन में एक बार खेला जा सकता है!</b>

    अपना पसंदीदा खेल चुनें और <i><b>BTC</b></i> कमाना शुरू करें!

user_wallets_caption = <b>CRYPTO QUEST -> वॉलेट्स</b>

    कृपया निकासी के लिए अपना वॉलेट नंबर दर्ज करें। किसी भी त्रुटि से बचने के लिए कृपया डाले गए डेटा को सत्यापित करें।

    <b>BITCOIN:</b> {$bitcoin_wallet}
    <b>TON:</b> {$ton_wallet}
    <b>TRC20:</b> {$trc20_wallet}

withdraw_caption = <b>CRYPTO QUEST -> निकासी</b>

    <b>💼 धन निकासी</b>

    यहां आप अपने अर्जित BTC को निर्दिष्ट वॉलेट में निकाल सकते हैं। कृपया सुनिश्चित करें कि आपकी शेष राशि निकासी के लिए पर्याप्त है, और दर्ज किए गए डेटा की सटीकता की जांच करें।

    न्यूनतम निकासी राशि: <b>0.000018BTC (50$)</b>।

    <i>नेटवर्क की लोडिंग के आधार पर निकासी में कुछ समय लग सकता है।</i>

language_caption = <b>CRYPTO QUEST -> भाषा का चयन</b>

    बॉट को आसानी से उपयोग करने के लिए अपनी पसंद की भाषा चुनें।

    आपका चयन सभी सेक्शनों और मेन्यू पर लागू होगा ताकि आपके लिए सेवा के साथ बातचीत करना आसान हो सके।

withdraw_request_created = 🟡 <b>निकासी का अनुरोध सफलतापूर्वक बनाया गया!</b>

    अब <b>वह राशि दर्ज करें</b> जिसे आप निकालना चाहते हैं और आपका अनुरोध पूरा हो जाएगा। इसके बाद, आपके BTC जल्द ही निर्दिष्ट वॉलेट में भेजे जाएंगे।

    आपके वॉलेट का नंबर:
    <code>{$wallet}</code>

withdraw_request_sent = निकासी का अनुरोध सफलतापूर्वक भेजा गया!
