back = वापस
basketball = बास्केटबॉल
basketball_game_caption = <b>CRYPTO QUEST -> BTC प्राप्त करें</b>

    <b>🏀 बास्केटबॉल में आपका स्वागत है!</b>

    अपनी शूटिंग क्षमताओं को आजमाएं और <b>BTC</b> अर्जित करें!

    बास्केट में गेंद डालें और प्रति सफल शॉट <b>0.0000017BTC</b> से <b>0.000017BTC</b> तक कमाएं।

    <i>यह गेम दिन में एक बार उपलब्ध है, इसलिए ध्यान से निशाना लगाएं और अपना इनाम प्राप्त करें!</i>

    क्या आप शॉट लेने और जीतने के लिए तैयार हैं? अभी आजमाएं!

cancel = रद्द करें
change = बदलें
close = बंद करें
connect = कनेक्ट करें
daily_reward = दैनिक बोनस
daily_reward_caption = <b>CRYPTO QUEST -> दैनिक बोनस</b>

    <b>हर दिन ₿ प्राप्त करें!</b>

    प्रतिदिन ऐप में लॉग इन करें और बिटकॉइन में बोनस प्राप्त करें!

    हर दिन आपके पास <b>0.0000017BTC ≈ 0.1$</b> से <b>0.000017BTC ≈ 1$</b> तक का बोनस प्राप्त करने का अवसर होता है, सिर्फ ऐप में प्रवेश करने के लिए।

    दैनिक बोनस का लाभ उठाने के लिए कोई भी दिन मिस न करें!

daily_reward_message = <b>🎉 आज का सरप्राइज! फॉर्च्यून ने आज आपको {$reward}BTC ≈ {$dollarReward}$ उपहार में दिया! 💫</b>

    नई पुरस्कारों के लिए रोज़ाना लॉग इन करते रहें और आपको हमेशा सफलता मिले! 🍀

daily_reward_received = 🔴 ओह! लगता है आपने आज का बोनस पहले ही प्राप्त कर लिया है! कल के नए सरप्राइज के लिए वापस आएं। शुभकामनाएं! 🍀
darts = डार्ट्स
darts_game_caption = <b>CRYPTO QUEST -> BTC प्राप्त करें</b>

    <b>🎯 डार्ट्स में आपका स्वागत है!</b>

    अपनी निशानेबाजी की क्षमता आजमाएं और <b>BTC</b> कमाएं!

    लक्ष्य पर मारें और प्रति सफल शॉट <b>0.0000017BTC</b> से <b>0.000017BTC</b> तक कमाएं।

    <i>यह गेम प्रति दिन एक बार उपलब्ध है, इसलिए ध्यान केंद्रित करें और अपना पुरस्कार प्राप्त करें!</i>
    डार्ट्स फेंकने और जीतने के लिए तैयार हैं? अभी आज़माएं!

darts_lose = 😕 दुर्भाग्य से, आज निशाना चूक गया। लेकिन हार मत मानिए, कल फिर कोशिश करें!
darts_win = 🎉 बधाई हो! आपने लक्ष्य साधा और {$reward} BTC अर्जित किया! बेहतरीन काम!
done = पूरा हुआ
football = फुटबॉल
football_game_caption = <b>CRYPTO QUEST -> BTC प्राप्त करें</b>

    <b>⚽ फुटबॉल में आपका स्वागत है!</b>

    अपनी गेंद पर नियंत्रण की क्षमता दिखाएं और <b>BTC</b> अर्जित करें!

    गोल करें और प्रति सफल शॉट <b>0.0000017BTC</b> से <b>0.000017BTC</b> तक कमाएं।

    <i>यह गेम प्रति दिन एक बार उपलब्ध है, इसलिए सटीक निशाना लगाएं और अपना इनाम प्राप्त करें!</i>

    मैदान में प्रवेश करने और जीतने के लिए तैयार हैं? अभी आज़माएं!
enter_new_wallet = कृपया अपना नया वॉलेट नंबर दर्ज करें
game_cooldown = आपने आज यह गेम पहले ही खेला है। कल फिर से प्रयास करें!
gamezone = गेम ज़ोन
gamezone_caption = <b>CRYPTO QUEST -> BTC प्राप्त करें</b>

    <b>गेम ज़ोन में आपका स्वागत है! 🎮</b>

    एक दिलचस्प मिनी-गेम चुनें और अभी <b>BTC</b> अर्जित करें:

    ⛏️ <b>माइनिंग</b> – वर्चुअल खानों में जाएं और बिटकॉइन प्राप्त करें!
    🎯 <b>डार्ट्स</b> – सटीकता महत्वपूर्ण है! लक्ष्य साधें और पुरस्कार प्राप्त करें।
    🏀 <b>बास्केटबॉल</b> – गेंद को बास्केट में डालें और बिटकॉइन जीतें।

    <i>हर गेम आपके क्रिप्टो पूंजी को बढ़ाने का एक मौका है!

    <b>हर गेम को एक दिन में एक बार खेला जा सकता है!</b>

    अपना पसंदीदा गेम चुनें और <b>BTC</b> कमाना शुरू करें!</i>

get_bitcoin = BTC प्राप्त करें
get_daily_reward = बोनस प्राप्त करें
insufficient_funds = 🔴 आपके खाते में पर्याप्त शेष नहीं है।
invite_friends = दोस्तों को आमंत्रित करें
language = भाषा
language_caption = <b>CRYPTO QUEST -> भाषा चयन</b>

    बॉट के उपयोग को सरल बनाने के लिए एक भाषा चुनें।

    आपकी चयनित भाषा सभी सेक्शन और मेन्यू पर लागू की जाएगी ताकि सेवा का उपयोग आपके लिए आसान हो सके।

language_changed = भाषा सफलतापूर्वक बदल दी गई है!
main_menu = मुख्य मेन्यू
main_menu_caption = <b>CRYPTO QUEST -> मुख्य मेन्यू</b>

    आप: <b>{$username}</b>
    बैलेंस: <b>{$balance}BTC ≈ {$dollarBalance}$</b>
    निकासी: <b>{$withdrawn}BTC ≈ {$dollarWithdrawn}$</b>
    रेफरल: <b>{$referrals}</b>
    टॉप में स्थान: <b>कोई नहीं</b>

    <a href="google.com">💬 <b>चैट</b></a>
mining = माइनिंग
mining_game_caption = <b>CRYPTO QUEST -> BTC प्राप्त करें</b>

    <b>माइनिंग प्रक्रिया का संक्षिप्त वर्णन:</b>
    <code>यह जटिल गणितीय समस्याओं को हल करने की एक प्रक्रिया है, जिसमें SHA-256 क्रिप्टोग्राफिक एल्गोरिदम का उपयोग किया जाता है। माइनर लेन-देन की पुष्टि करते हैं और एक अद्वितीय हैश खोजकर ब्लॉकचेन के लिए नए ब्लॉक बनाते हैं।</code>

    <b>इसके लिए बिटकॉइन क्यों मिलता है:</b>
    <code>माइनर को सफलतापूर्वक ब्लॉक जोड़ने के लिए बिटकॉइन दिए जाते हैं। इससे नेटवर्क को सुचारू रूप से चलाने और इसकी सुरक्षा बनाए रखने के लिए प्रतिभागियों को प्रोत्साहन मिलता है।</code>

mining_success_end = 🎉 ब्लॉक मिला! आपने {$reward} BTC कमाए।
my_wallets = मेरे वॉलेट्स
next = आगे
no_subscribe = 🔴 आपने अभी तक कार्य पूरा नहीं किया है। इनाम प्राप्त करने के लिए कार्य पूरा करें!
operation1 = माइनिंग प्रक्रिया की शुरुआत
operation10 = ब्लॉक को श्रृंखला में शामिल करना और सभी नोड्स पर डेटा को अपडेट करना
operation2 = SHA-256 क्रिप्टोग्राफिक एल्गोरिदम को सही हैश खोजने के लिए प्रारंभ करना
operation3 = वितरित नेटवर्क नोड्स के साथ कनेक्शन स्थापित करना
operation4 = नए ब्लॉक के निर्माण के लिए लेन-देन डेटा एकत्र करना
operation5 = डेटा की अखंडता की जांच और लेन-देन की पुष्टि करना
operation6 = ब्लॉक के समाधान के लिए कम्प्यूटेशनल शक्तियों का अनुकूलन
operation7 = लक्ष्य हैश मान प्राप्त करने के लिए सही नॉनस की खोज करना
operation8 = माइनिंग प्रक्रिया की शुरुआत
operation9 = खोजे गए समाधान की पुष्टि करना और इसे नेटवर्क में प्रसारित करना
referral_message = 🚀 क्या आप कुछ बेहद शानदार आज़माना चाहते हैं? मैंने एक बॉट ढूंढा है, जहां आप मिनी-गेम्स खेलकर BTC कमा सकते हैं! 🎮 🎯

    डार्ट्स फेंको, बिटकॉइन माइन करो या बास्केट में गेंद डालो – और हर बार आपको असली BTC मिलता है! 💸

referrals_caption = <b>CRYPTO QUEST -> रेफरल्स</b>

    <b>अपने दोस्तों को आमंत्रित करें और इनाम प्राप्त करें!</b> 👥

    हमारे रेफरल प्रोग्राम में शामिल हों: हर आमंत्रित उपयोगकर्ता के लिए आपको बोनस इनाम मिलेगा। <b>({$reward}BTC ≈ {$dollarReward}$)</b>

    अपनी अनोखी रेफरल लिंक साझा करें और पुरस्कार जीतने के अपने अवसरों को बढ़ाएं।
    जितने अधिक दोस्त – उतने अधिक इनाम!

search_for_block = ब्लॉक की खोज शुरू करें
start_mining = माइनिंग प्रक्रिया शुरू
subscribe = सब्सक्राइब करें
subscribed = सब्सक्राइब किया गया
task_completed = 🔴 आपने पहले ही यह कार्य पूरा कर लिया है। आपकी भागीदारी के लिए धन्यवाद!
task_message = <b>CRYPTO QUEST -> कार्य</b>

    {$taskDescription}

    <b>{$award}BTC ≈ {$dollarReward}$</b>

    🔗 <a href="">लिंक</a>
    {$link}

    प्रतीक्षा में...

tasks = कार्य
thanks_for_subscribe = <b>CRYPTO QUEST -> कार्य</b>

                       🟢 कार्य पूरा करने के लिए धन्यवाद!

                       आपको <b>{$award}BTC ≈ {$dollarReward}$</b> प्राप्त हुए हैं

throw_ball = गेंद फेंको
throw_dart = डार्ट फेंको
user_wallets_caption = <b>CRYPTO QUEST -> वॉलेट्स</b>

    फंड्स निकालने के लिए अपना वॉलेट नंबर दर्ज करें। कृपया ट्रांसफर के दौरान किसी भी त्रुटि से बचने के लिए डेटा की सटीकता की जांच करें।

    <b>BITCOIN :</b> {$bitcoin_wallet}
    <b>TON :</b> {$ton_wallet}
    <b>TRC20 :</b> {$trc20_wallet}

wallet_changed = वॉलेट सफलतापूर्वक बदल दिया गया है!
withdraw = निकासी
withdraw_caption = <b>CRYPTO QUEST -> निकासी</b>

    <b>💼 फंड्स की निकासी</b>

    यहाँ आप अर्जित BTC को अपने निर्दिष्ट वॉलेट में निकाल सकते हैं। सुनिश्चित करें कि निकासी के लिए आपका बैलेंस पर्याप्त हो और...
