get_daily_reward = Получить бонус
gamezone = Игровая
daily_reward = Ежедневный бонус
connect = Подключить
close = Закрыть
cancel = Отмена
subscribe = Подписаться
subscribed = Подписался
done = Выполнено
back = Назад
next = Вперёд
language = Язык
get_bitcoin = Получить BTC
my_wallets = Мои кошельки
withdraw = Вывести
tasks = Задания
invite_friends = Пригласить друзей
change = Изменить
main_menu = Главное меню
withdrawal = Вывод на
mining = Майнинг
darts = Дартс
basketball = Баскетбол
search_for_block = Начать поиск блока
throw_dart = Бросить дротик
throw_ball = Бросить мяч
language_changed = Язык успешно изменён!
enter_new_wallet = Укажите ваш новый номер кошелька
wallet_changed = Кошелёк успешно изменён!
game_cooldown = Вы уже играли в эту игру сегодня. Попробуйте снова завтра!
darts_win = 🎉 Поздравляем! Ты метко попал в цель и заработал 0.0001 BTC! Отличная работа!
darts_lose = 😕 Увы, сегодня промах. Но не сдавайся, попробуй снова завтра!
start_mining = Процесс майнинга запущен
mining_success_end = 🎉 Блок найден! Вы заработали 0.0001 BTC.
insufficient_funds = 🔴 У вас недостаточно средств на счету.
no_subscribe = 🔴 Вы еще не выполнили задание. Выполните задание, чтобы получить свое вознаграждение!
referral_message = 🚀 Хочешь попробовать что-то действительно крутое? Я нашел бота, где можно зарабатывать BTC, просто играя в мини-игры! 🎮 🎯

    Бросай дротики, копай биткоины или закидывай мячи в корзину — и каждый раз за это получаешь настоящие BTC! 💸
task_message = <b>CRYPTO QUEST -> Задача</b>

    {$taskDescription}

    <b>{$award}BTC</b>

    🔗 <a href="">Ссылка</a>
    {$link}

    Ожидание...
thanks_for_subscribe = <b>CRYPTO QUEST -> Task</b>

                       🟢 Cпасибо за выполненное задание!

                       Получено <b>{$award}BTC.</b>
main_menu_caption = <b>CRYPTO QUEST -> Главное меню</b>

    Ты: <b>{$username}</b>
    Баланс: <b>{$balance}BTC</b>
    Выведено: <b>{$withdrawn}BTC</b>
    Рефералов: <b>{$referrals}</b>
    Место в топе: <b>Нет</b>

    <a href="google.com">💬 <b>Чат</b></a>
mining_game_caption = <b>CRYPTO QUEST -> Получить BTC</b>

    <b>Краткое описание процесса майнинга:</b>
    <code>Это процесс решения сложных математических задач с использованием криптографического алгоритма SHA-256. Майнеры проверяют транзакции и создают новые блоки для блокчейна, подбирая уникальный хеш.</code>

    <b>Почему за это можно получить биткоин:</b>
    <code>За успешное добавление блока в блокчейн майнеры получают биткоины. Это стимулирует участников сети поддерживать ее работу и безопасность.</code>
darts_game_caption = <b>CRYPTO QUEST -> Получить BTC</b>

    <b>🎯 Добро пожаловать в Дартс!</b>
    Проверь свою меткость и зарабатывай <b>BTC!</b>
    Попадай в цель и получай <b>0.0001BTC</b> за каждый успешный бросок.

    <i>Игра доступна раз в сутки, так что сосредоточься и забирай свою награду!</i>
    Готов метнуть дротик и выиграть? Попробуй прямо сейчас!;

gamezone_caption = <b>CRYPTO QUEST -> Получить BTC</b>

    <b>Добро пожаловать в зону игр! 🎮</b>

    Выбирай одну из увлекательных мини-игр и зарабатывай <b>BTC</b> прямо сейчас:
    ⛏️ <b>Майнинг</b> – отправляйся на виртуальные шахты и добывай биткоины!
    🎯 <b>Дартс</b> – меткость решает! Попади в цель и получи награду.
    🏀 <b>Баскетбол</b> – бросай мяч в кольцо и выигрывай биткоины.

    <i>Каждая игра – это шанс приумножить свой криптокапитал!

    <b>В каждую из игр можно сыграть один раз в сутки!</b>

    Выбирай свою любимую игру и начинай зарабатывать</i><b> BTC</b>!

darts_game_caption = <b>CRYPTO QUEST -> Получить BTC</b>

    <b>🎯 Добро пожаловать в Дартс!</b>

    Проверь свою меткость и зарабатывай <b>BTC!</b>
    Попадай в цель и получай <b>0.0001BTC</b> за каждый успешный бросок.

    <i>Игра доступна раз в сутки, так что сосредоточься и забирай свою награду!</i>

    Готов метнуть дротик и выиграть? Попробуй прямо сейчас!

basketball_game_caption = <b>CRYPTO QUEST -> Получить BTC</b>

    <b>🏀 Добро пожаловать в баскетбол!</b>

    Проверьте свои навыки стрельбы и заработайте <b>BTC</b>!
    Забивайте мячи в корзину и получайте <b>0.0001BTC</b> за каждый удачный бросок.

    <i>Игра доступна один раз в день, так что цельтесь внимательно и получайте свое вознаграждение!</i>

    Готовы сделать свой бросок и выиграть? Попробуйте прямо сейчас!

user_wallets_caption = <b>CRYPTO QUEST -> Кошельки</b>

    Укажите номер кошелька для вывода средств. Пожалуйста, проверьте корректность данных, чтобы избежать ошибок при переводе.

    <b>BITCOIN:</b> {$bitcoin_wallet}
    <b>TON:</b> {$ton_wallet}
    <b>TRC20:</b> {$trc20_wallet}

withdraw_caption = <b>CRYPTO QUEST -> Вывод</b>

    <b>💼 Вывод средств</b>

    Здесь вы можете вывести заработанные BTC на указанный вами кошелек. Убедитесь, что ваш баланс достаточен для вывода, и проверьте правильность введенных данных.

    Минимальная сумма для вывода: <b>0.0086BTC (500$)</b>.

    <i>Вывод средств может занять некоторое время в зависимости от загрузки сети.</i>

language_caption = <b>CRYPTO QUEST -> Выбор языка</b>

    Выберите язык для удобного использования бота.

    Ваш выбор будет применен ко всем разделам и меню, чтобы вам было проще взаимодействовать с сервисом.

withdraw_request_created = 🟡 <b>Заявка на вывод успешно создана!</b>

    Теперь <b>укажите сумму</b>, которую хотите вывести, и ваша заявка будет полностью оформлена. После этого ваши BTC будут отправлены на указанный кошелек в ближайшее время.

    Номер вашего кошелька:
    <code>{$wallet}</code>

referrals_caption = <b>CRYPTO QUEST -> Рефералы</b>

    <b>Приглашай друзей и получай вознаграждения!</b> 👥

    Присоединяйся к нашей реферальной программе: за каждого приглашённого пользователя, ты получишь бонусное вознаграждения. <b>({$reward}BTC)</b>

    Делись своей уникальной реферальной ссылкой и увеличивай свои шансы на получение призов.
    Чем больше друзей — тем больше наград!

daily_reward_caption = <b>CRYPTO QUEST -> Ежедневный бонус</b>

    <b>Получай ₿ каждый день!</b>

    Заходи в приложение ежедневно и получай бонус в биткоинах!

    Каждый день у тебя есть возможность получить бонус от <b>0.0000017BTC</b> до <b>0.000017BTC</b> просто за то, что заходишь в приложение.

    Не пропускай ни дня, чтобы воспользоваться преимуществами ежедневного бонуса!

daily_reward_message = <b>🎉 Сюрприз дня! Фортуна сегодня подарила вам {$reward}BTC! 💫</b>

    Продолжайте заходить ежедневно за новыми наградами и пусть удача всегда будет с вами! 🍀

daily_reward_received = 🔴 Ой! Похоже, вы уже забрали свой сегодняшний бонус! Возвращайтесь завтра за новым сюрпризом. Удачи! 🍀

withdraw_request_sent = Заявка на вывод успешно отправлена!

operation1 = Инициализация майнингового процесса
operation2 = Запуск криптографического алгоритма SHA-256 для поиска подходящего хеша
operation3 = Установка соединения с распределенной сетью узлов
operation4 = Сбор данных транзакций для формирования нового блока
operation5 = Проверка целостности данных и верификация транзакций
operation6 = Оптимизация вычислительных мощностей для решения блока
operation7 = Поиск корректного nonce для достижения целевого хеш-значения
operation8 = Инициализация майнингового процесса
operation9 = Подтверждение найденного решения и его трансляция в сеть
operation10 = Включение блока в цепочку и обновление данных на всех узлах
